In [2]:
#!conda info

**List Materi :**

01. prefix dan suffix
02. Pemilihan baris (rows selection) pada Data Frame
03. Konversi tipe data String ke Numerik pada kolom Data Frame
04. Pemilihan kolom (columns selection) berdasarkan tipe data
05. Membalik urutan baris dan kolom pada Data Frame
06. Mengganti nama kolom pada Data Frame
07. Menghapus (Drop) missing values (NaN) pada Data Frame
08. Memeriksa kesamaan antar kolom (Series) pada Data Frame
09. Membagi data frame menjadi dua secara acak
10. Mengganti nama kolom pada Data Frame berdasarkan pola
11. Seleksi kolom dan baris pada data frame menggunakan loc
12. Membentuk kolom bertipe datetime dari beberapa kolom lain pada data frame
13. Konversi nilai numerik ke dalam kategori pada Data Frame
14. Menggabungkan dua pandas data frame (mergeging)
15. Memecah nilai string suatu kolom ke dalam beberapa kolom baru

In [3]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

print(pd.__version__)
print(np.__version__)

1.5.2
1.23.5

**01. Prefix dan Suffix pada seluruh Kolom Pandas Data Frame**

- prefix menambahkan string di depan string
- suffix menambahkan string di belakang string

In [3]:
x_rows = 5
x_cols = 5
cols = tuple('ABCDE') #untuk penamaan label kolom

#membuat table dengan isi angka random
df = pd.DataFrame(np.random.randint(1, 10, size =(x_rows, x_cols)), columns = cols)
df

   A  B  C  D  E
0  4  9  7  8  5
1  9  2  9  2  1
2  4  5  2  5  8
3  4  7  3  7  3
4  7  4  8  4  5

**prefix**

In [14]:
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        4        6        9        9        2
1        7        6        2        4        6
2        2        1        4        4        6
3        8        9        8        1        8
4        3        4        8        7        1

**suffix**

In [15]:
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        4        6        9        9        2
1        7        6        2        4        6
2        2        1        4        4        6
3        8        9        8        1        8
4        3        4        8        7        1

**02. Pemilihan baris (rows selection) pada Data Frame**

In [4]:
a_rows = 11
a_cols = 6
cols = tuple('ABCDEF')

#membuat table dengan isi angka random
df = pd.DataFrame(np.random.randint(10, 20, size =(a_rows, a_cols)), columns = cols)
df

     A   B   C   D   E   F
0   13  19  17  13  19  19
1   16  18  15  10  16  10
2   12  13  17  10  16  16
3   11  19  10  16  18  17
4   15  15  16  16  18  17
5   14  19  12  18  12  18
6   16  14  18  12  11  16
7   19  18  19  14  18  18
8   17  17  13  17  10  18
9   18  19  12  17  12  11
10  14  17  15  17  10  15

Selection dengan fungsi **isin()**

ini sama dengan penggunaan operator logika or (|)

In [5]:
#mencari angka 12 dan 17 pada kolom A
df[df['A'].isin([12, 17])]

    A   B   C   D   E   F
2  12  13  17  10  16  16
8  17  17  13  17  10  18

Operator negasi (~) berguna untuk mencari nilai yang tidak sama

In [21]:
#mencari angka selain 12 dan 17 pada kolom A
df[~df['A'].isin([12, 17])]

     A   B   C   D   E   F
0   15  13  11  13  18  11
3   11  17  14  16  16  18
4   14  19  12  10  12  19
5   13  18  13  14  12  16
8   13  12  11  18  13  15
9   11  10  15  15  11  19
10  10  16  12  11  12  18

**03. Konversi tipe data String ke Numerik pada kolom Data Frame**

In [4]:
data = {
    'col_a' : ['1', '2', '3', 'teks'],
    'col_b' : ['1', '2', '3', '4']
}

ds = pd.DataFrame(data)
ds

  col_a col_b
0     1     1
1     2     2
2     3     3
3  teks     4

In [5]:
ds.info() #menggunakan ini, informasi mengenai datanya lebih lengkap

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col_a   4 non-null      object
 1   col_b   4 non-null      object
dtypes: object(2)
memory usage: 192.0+ bytes

In [6]:
ds.dtypes #jika menggunakan ini hanya menampilkan type data dari setiap kolomnya

col_a    object
col_b    object
dtype: object

Konversi tipe data dengan fungsi **astype()** pada satu kolom saja

In [18]:
# ds_1 = ds.astype({'col_b':'float'}) #int (integer), float, object
# ds_1

# ds_1.dtypes

ds['col_b'] = ds['col_b'].astype('int64') #pakai cara ini saja, tidak membuat variabel baru seperti contoh diatas.
ds

  col_a  col_b
0     1      1
1     2      2
2     3      3
3  teks      4

In [19]:
ds.dtypes

col_a    object
col_b     int64
dtype: object

Konversi tipe data numerik dengan fungsi **to_numeric()**

penggunaan fungsi ini jika kita ingin konversi data ke data numeric kekeseluruhan data frame.

In [20]:
ds.apply(pd.to_numeric, errors = 'coerce')
#kegunaan parameter coerce jika kita menemukan atau terdapat data yang tidak bisa diubah ke data numeric, data tersebut akan dianggap/diubah menjadi NaN atau dianggap sebagai missing value.

   col_a  col_b
0    1.0      1
1    2.0      2
2    3.0      3
3    NaN      4

**04. Pemilihan kolom (columns selection) berdasarkan tipe data**

In [23]:
rows_x = 5
cols_y = 2
cols1 = ['bil_pecahan', 'bil_bulat']

dst = pd.DataFrame(np.random.randint(10, 20, size = (rows_x, cols_y)), columns = cols1)

dst['bil_pecahan'] = dst['bil_pecahan'].astype('float')

dst.index = pd.util.testing.makeDateIndex(rows_x, freq = 'H')
dst = dst.reset_index() #berguna untuk generate index baru berupa generate int 

dst['teks'] = list('ABCDE')

dst

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00         19.0         10    A
1 2000-01-01 01:00:00         13.0         14    B
2 2000-01-01 02:00:00         18.0         19    C
3 2000-01-01 03:00:00         14.0         14    D
4 2000-01-01 04:00:00         16.0         19    E

In [24]:
dst.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

Memilih kolom berdasarkan tipe data, numeric.

In [ ]:
dst.select_dtypes(include = 'int64')
dst.select_dtypes(include = 'float')
dst.select_dtypes(include = 'number')

Memilih kolom berdasarkan tipe data, object.

In [ ]:
dst.select_dtypes(include = 'object')

Memilih kolom berdasarkan tipe data, datetime.

In [ ]:
dst.select_dtypes(include = 'datetime')

Memilih kolom dengan kombinasi tipe data

In [ ]:
dst.select_dtypes(include = ['int', 'object'])

**05. Membalik urutan baris dan kolom pada Data Frame**

In [43]:
b_rows = 6
b_cols = 6
cols = tuple('ABCDEF')

df = pd.DataFrame(np.random.randint(1, 10, size = (b_rows, b_cols)), columns = cols)
df

   A  B  C  D  E  F
0  4  4  2  3  1  2
1  3  6  4  7  2  5
2  5  1  2  7  8  4
3  4  3  9  7  3  4
4  9  3  9  5  3  1
5  2  6  1  8  8  3

Membalik urutan kolom

In [27]:
df. loc[:, ::-1]
# df.loc[untuk mengatur baris, untuk mengatur kolom]
# untuk menyertakan keseluruhan baris dan tidak melakukan perubahan gunakan tanda blank (:)
# -1 artinya reversing(pembalikan)

   F  E  D  C  B  A
0  4  6  1  4  5  1
1  2  9  3  9  1  7
2  6  2  2  7  3  1
3  2  2  3  3  7  3
4  8  7  2  9  1  9
5  6  2  1  3  3  5

Membalik urutan baris

In [28]:
df.loc[::-1] 
#tidak perlu menuliskan elemen ke 2 atau pada bagian kolom cukup tulis bagian baris saja

   A  B  C  D  E  F
5  5  3  3  1  2  6
4  9  1  9  2  7  8
3  3  7  3  3  2  2
2  1  3  7  2  2  6
1  7  1  9  3  9  2
0  1  5  4  1  6  4

Membalik urutan baris tanpa merubah indexnya / nomor index

In [29]:
df.loc[::-1].reset_index(drop = True)

   A  B  C  D  E  F
0  5  3  3  1  2  6
1  9  1  9  2  7  8
2  3  7  3  3  2  2
3  1  3  7  2  2  6
4  7  1  9  3  9  2
5  1  5  4  1  6  4

**06 Mengganti nama kolom pada Data Frame**

In [30]:
x_rows = 5
x_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size = (x_rows, x_cols)), columns = cols)
df

   A  B  C  D  E
0  7  7  6  6  6
1  4  3  7  8  4
2  1  8  6  5  1
3  9  6  9  1  1
4  2  2  6  1  2

mengganti nama label kolom data frame

In [33]:
df.rename(columns = {'C':'City'})

   A  B  City  D  E
0  7  7     6  6  6
1  4  3     7  8  4
2  1  8     6  5  1
3  9  6     9  1  1
4  2  2     6  1  2

In [45]:
#contoh untuk perubahan label pada banyak kolom
df.rename(columns = {'A':'Id', 'B':'Number', 'E':'Total'})

   Id  Number  C  D  Total  F
0   4       4  2  3      1  2
1   3       6  4  7      2  5
2   5       1  2  7      8  4
3   4       3  9  7      3  4
4   9       3  9  5      3  1
5   2       6  1  8      8  3

**07. Menghapus (Drop) missing values (NaN) pada Data Frame**

In [55]:
df = pd.util.testing.makeMissingDataframe().reset_index()
df.head()

        index         A         B         C         D
0  5bqXUidAph  1.202569 -0.659721 -0.307293  0.914691
1  zAGyLLu0AV  0.544397 -1.341075 -0.736865  1.382881
2  UFxo9QsXH0 -1.872508       NaN -2.026592  0.861102
3  c1SybnUTiA  0.060464 -1.244139 -0.666900  0.721122
4  yNdQsf961W -0.280099  0.387535  0.514680       NaN

In [56]:
df = df.rename(columns = {'index':'X'})
df.head()

            X         A         B         C         D
0  5bqXUidAph  1.202569 -0.659721 -0.307293  0.914691
1  zAGyLLu0AV  0.544397 -1.341075 -0.736865  1.382881
2  UFxo9QsXH0 -1.872508       NaN -2.026592  0.861102
3  c1SybnUTiA  0.060464 -1.244139 -0.666900  0.721122
4  yNdQsf961W -0.280099  0.387535  0.514680       NaN

In [57]:
df_backup = df.copy(deep = True)

Menghapus setiap kolom yang mengandung missing value

In [58]:
df = df.dropna(axis = 'columns')
df.head()

            X
0  5bqXUidAph
1  zAGyLLu0AV
2  UFxo9QsXH0
3  c1SybnUTiA
4  yNdQsf961W

Menghapus baris yang mengandung missing value

In [60]:
df = df_backup.copy(deep = True)
df = df.dropna(axis = 'rows')
df.head()

            X         A         B         C         D
0  5bqXUidAph  1.202569 -0.659721 -0.307293  0.914691
1  zAGyLLu0AV  0.544397 -1.341075 -0.736865  1.382881
3  c1SybnUTiA  0.060464 -1.244139 -0.666900  0.721122
5  zcUmoTGwdo  0.072360 -0.115522 -0.896742  1.184887
8  2AuSoU4h7N  2.244799  1.643130 -0.763703  0.262414

Mengecek presentase missing value tiap kolom

In [61]:
df = df_backup.copy(deep = True)
df.isna().mean()

X    0.000000
A    0.066667
B    0.100000
C    0.100000
D    0.133333
dtype: float64

Menghapus kolom yang mengandung missing value berdasarkan threshold, sama dengan menghapus kolom berdasarkan presentase missing valuenya

In [62]:
treshold = len(df) * 0.9 #menghapus missing value pada kolom yang melebihi berdasarkan persentase
df = df.dropna(thresh = treshold, axis = 'columns')
df.head()

            X         A         B         C
0  5bqXUidAph  1.202569 -0.659721 -0.307293
1  zAGyLLu0AV  0.544397 -1.341075 -0.736865
2  UFxo9QsXH0 -1.872508       NaN -2.026592
3  c1SybnUTiA  0.060464 -1.244139 -0.666900
4  yNdQsf961W -0.280099  0.387535  0.514680

**08. Memeriksa kesamaan antar kolom (Series) pada Data Frame**

In [3]:
data = {
    'A' : [15, 15, 18, np.nan, 12],
    'B' : [15, 15, 18, np.nan, 12]
}

df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

Mengenal Pandas Series
- Pada dasarnya Series adalah kolom
- Setiap data frame terdiri dari series

In [4]:
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [6]:
type(df['A'])

pandas.core.series.Series

In [7]:
type(df)

pandas.core.frame.DataFrame

In [9]:
#mengecek persamaan nilai pada kolom atau data frame
df['A'].equals(df['B'])

True

**09. Membagi data frame menjadi dua secara acak**

In [3]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size = (n_rows, n_cols)), columns = cols)

df

   A  B  C  D  E
0  4  7  2  8  9
1  6  4  4  9  3
2  1  6  1  7  1
3  9  9  7  3  5
4  6  6  7  4  8
5  9  9  9  8  4
6  7  4  6  1  6
7  7  8  7  6  4
8  1  4  1  9  5
9  3  3  1  3  9

In [4]:
df.shape

(10, 5)

In [5]:
proporsi = 0.7 #mengambil 70% dari data frame
df_1 = df.sample(frac = proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1 shape : {df_1.shape}')
print(f'df_2 shape : {df_2.shape}')

df_1 shape : (7, 5)
df_2 shape : (3, 5)

In [6]:
df_1 #hasil secara random 70%

   A  B  C  D  E
6  7  4  6  1  6
2  1  6  1  7  1
9  3  3  1  3  9
0  4  7  2  8  9
4  6  6  7  4  8
7  7  8  7  6  4
3  9  9  7  3  5

In [7]:
df_2 #hasil secara random 30%

   A  B  C  D  E
1  6  4  4  9  3
5  9  9  9  8  4
8  1  4  1  9  5

**10. Mengganti nama kolom pada Data Frame berdasarkan pola**

In [ ]:
#berikut code untuk mengganti nama kolom

#mengganti spasi dengan _
df.columns = df.columns.str.replace(' ', '_').str.lower() #menggunakan lowercase untuk membuat semua menjadi huruf kecil.
df.head()

In [ ]:
#Memangkas kelebihan spasi di kanan/kiri nama kolom dengan str.strip()

#REKOMENDASI LANGSUNG SAJA MENGGUNAKAN CODE INI
df.columns = df.columns.str.lower().str.strip().str.replace(' ', '_')
df.head()

**11. Seleksi kolom dan baris pada data frame menggunakan loc**

In [9]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size =(n_rows, n_cols)), columns = cols)
df

    A   B   C   D   E
0   2  14  12  16  10
1   6   6   8  15  19
2   6  10   2   2  13
3  10   7  12  15   1
4  11   8  10  10  10
5   2  10  11  16  18
6   6   9  19   7  12
7  19   1   1  14   6
8  11   6  15   9   9
9   3   5  10  19   8

Seleksi kolom dan baris menggunakan loc

In [10]:
#bagian kurung pertama untuk mengatur baris, bagian kurung kedua untuk kolom.

#bacanya jadi = kita ingin menampilkan baris 0,3,4 dan kolom B dan E
df.loc[[0, 3, 4], ['B', 'E']]

    B   E
0  14  10
3   7   1
4   8  10

Seleksi baris dengan kondisi

In [13]:
df.loc[df['B'] > 5, ['B', 'D', 'E']]

    B   D   E
0  14  16  10
1   6  15  19
2  10   2  13
3   7  15   1
4   8  10  10
5  10  16  18
6   9   7  12
8   6   9   9

Slicing data frame dengan loc

In [16]:
df.loc[4:6, 'B':'D']

    B   C   D
4   8  10  10
5  10  11  16
6   9  19   7

**12. Membentuk kolom bertipe datetime dari beberapa kolom lain pada data frame**

In [4]:
data = {
    'day' : [1, 6, 8, 14, 22],
    'month' : [1, 2, 6, 10, 12],
    'year' : [2018, 2019, 2020, 2021, 2022]
}

df = pd.DataFrame(data)
df

   day  month  year
0    1      1  2018
1    6      2  2019
2    8      6  2020
3   14     10  2021
4   22     12  2022

In [10]:
df['penanggalan'] = pd.to_datetime(df[['day', 'month', 'year']])
df

   day  month  year penanggalan
0    1      1  2018  2018-01-01
1    6      2  2019  2019-02-06
2    8      6  2020  2020-06-08
3   14     10  2021  2021-10-14
4   22     12  2022  2022-12-22

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          5 non-null      int64
 1   month        5 non-null      int64
 2   year         5 non-null      int64
 3   penanggalan  5 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(3)
memory usage: 288.0 bytes

**13. Konversi nilai numerik ke dalam kategori pada Data Frame**

In [20]:
n_rows = 10
n_cols = 1
cols = ('usia', )

df = pd.DataFrame(np.random.randint(1, 99, size = (n_rows, n_cols)), columns = cols)
df

   usia
0    62
1    85
2    49
3    34
4    93
5    14
6    84
7    80
8    77
9    10

Mengelompokkan nilai numerik manjadi beberapa kategori menggunakan **cut()**

In [21]:
df['Kategori usia'] = pd.cut(df['usia'], 
    bins = [1, 18, 65, 99],
    labels = ['anak-anak', 'dewasa', 'Tua'])
df

   usia Kategori usia
0    62        dewasa
1    85           Tua
2    49        dewasa
3    34        dewasa
4    93           Tua
5    14     anak-anak
6    84           Tua
7    80           Tua
8    77           Tua
9    10     anak-anak

**14. Menggabungkan dua pandas data frame (mergeging)**

In [24]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size = (n_rows, n_cols)), columns = cols)
df

    A   B   C   D   E
0  14   3   3   1  13
1  17  18   9   1   3
2   3  17   7  19   6
3   3  12   5  14  17
4   1  14  10   6  16

In [25]:
df1 = df.copy(deep = True)
df1 = df1.drop([1, 4])
df1

    A   B  C   D   E
0  14   3  3   1  13
2   3  17  7  19   6
3   3  12  5  14  17

In [26]:
df2 = df.copy(deep = True)
df2 = df2.drop([0, 3])
df2

    A   B   C   D   E
1  17  18   9   1   3
2   3  17   7  19   6
4   1  14  10   6  16

In [27]:
#pada penggunaan 'inner' akan menggabungkan 2 buah data frame yang ada pada kedua data frame sumbernya (yang sama akan ditampilkan), lalu akan menambilkan index yang baru

df_inner = pd.merge(df1, df2, how = 'inner')
df_inner

   A   B  C   D  E
0  3  17  7  19  6

In [29]:
#pada penggunaan 'outer' akan menggabungkan kedua data frame namun akan menghapus data yang duplikasi
#ini yang sering digunakan pada real job.

df_outer = pd.merge(df1, df2, how = 'outer')
df_outer

    A   B   C   D   E
0  14   3   3   1  13
1   3  17   7  19   6
2   3  12   5  14  17
3  17  18   9   1   3
4   1  14  10   6  16

**15. Memecah nilai string suatu kolom ke dalam beberapa kolom baru**

In [12]:
data = {
    'nama' : ['Budi Yoso', 'Dudi Anduk', 'Ruri Asri', 'Andi Setio'],
    'tempat_tinggal' : ['Surabaya, Jatim', 'Depok, Jabar', 'Lombok, NTT', 'Bandung, Jabar']
}

df = pd.DataFrame(data)
df

         nama   tempat_tinggal
0   Budi Yoso  Surabaya, Jatim
1  Dudi Anduk     Depok, Jabar
2   Ruri Asri      Lombok, NTT
3  Andi Setio   Bandung, Jabar

In [13]:
df[['nama_depan', 'nama_belakang']] = df['nama'].str.split(' ', expand = True)
df

         nama   tempat_tinggal nama_depan nama_belakang
0   Budi Yoso  Surabaya, Jatim       Budi          Yoso
1  Dudi Anduk     Depok, Jabar       Dudi         Anduk
2   Ruri Asri      Lombok, NTT       Ruri          Asri
3  Andi Setio   Bandung, Jabar       Andi         Setio

In [14]:
df[['kota', 'provinsi']] = df['tempat_tinggal'].str.split(',', expand = True)
df

         nama   tempat_tinggal nama_depan nama_belakang      kota provinsi
0   Budi Yoso  Surabaya, Jatim       Budi          Yoso  Surabaya    Jatim
1  Dudi Anduk     Depok, Jabar       Dudi         Anduk     Depok    Jabar
2   Ruri Asri      Lombok, NTT       Ruri          Asri    Lombok      NTT
3  Andi Setio   Bandung, Jabar       Andi         Setio   Bandung    Jabar

**16. Menata ulang Data Frame dengan multiple indexes menggunakan unstack**

In [4]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [13]:
#merubah label kolom menjadi lowercase
df.columns = df.columns.str.lower()
df.head()

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [14]:

df.groupby(['sex', 'pclass'])['survived'].mean().to_frame()

               survived
sex    pclass
female 1            1.0
       2            1.0
       3            1.0
male   1            0.0
       2            0.0
       3            0.0